victor999/nrf52-env-beacon/env-beacon_v2/src/sensor_beacon.c
/* Copyright (c) Nordic Semiconductor ASA
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 * 
 *   1. Redistributions of source code must retain the above copyright notice, this
 *   list of conditions and the following disclaimer.
 * 
 *   2. Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 * 
 *   3. Neither the name of Nordic Semiconductor ASA nor the names of other
 *   contributors to this software may be used to endorse or promote products
 *   derived from this software without specific prior written permission.
 * 
 *   4. This software must only be used in a processor manufactured by Nordic
 *   Semiconductor ASA, or in a processor manufactured by a third party that
 *   is used in combination with a processor manufactured by Nordic Semiconductor.
 * 
 * 
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include "hal_radio.h"
#include "hal_timer.h"
#include "hal_clock.h"
#include "drv_bme280.h"
#include "drv_mcp9808.h"
#include "hal_serial.h"
#include "hal_twi.h"

#include "nrf.h"

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <stdlib.h>

#include "nrf_drv_saadc.h"

#include "nrf_error.h"

#define APP_IRQ_PRIORITY_LOW 6


/* #define DBG_RADIO_ACTIVE_ENABLE      */

/* #define DBG_BEACON_START_PIN    (16) */
/* #define DBG_HFCLK_ENABLED_PIN   (27) */
/* #define DBG_HFCLK_DISABLED_PIN  (26) */
/* #define DBG_PKT_SENT_PIN        ( 9) */
/* #define DBG_CALCULATE_BEGIN_PIN (15) */
/* #define DBG_CALCULATE_END_PIN   (15) */
/* #define DBG_RADIO_ACTIVE_PIN    (24) */
/* #define DBG_WFE_BEGIN_PIN       (25) */
/* #define DBG_WFE_END_PIN         (25) */


/* #define DBG_BEACON_START                           \
{                                                     \
    NRF_GPIO->OUTSET = (1 << DBG_BEACON_START_PIN);   \
    NRF_GPIO->DIRSET = (1 << DBG_BEACON_START_PIN);   \
    NRF_GPIO->DIRCLR = (1 << DBG_BEACON_START_PIN);   \
    NRF_GPIO->OUTCLR = (1 << DBG_BEACON_START_PIN);   \
} */
/* #define DBG_HFCLK_ENABLED                          \
{                                                     \
    NRF_GPIO->OUTSET = (1 << DBG_HFCLK_ENABLED_PIN);  \
    NRF_GPIO->DIRSET = (1 << DBG_HFCLK_ENABLED_PIN);  \
    NRF_GPIO->DIRCLR = (1 << DBG_HFCLK_ENABLED_PIN);  \
    NRF_GPIO->OUTCLR = (1 << DBG_HFCLK_ENABLED_PIN);  \
} */
/* #define DBG_HFCLK_DISABLED                         \
{                                                     \
    NRF_GPIO->OUTSET = (1 << DBG_HFCLK_DISABLED_PIN); \
    NRF_GPIO->DIRSET = (1 << DBG_HFCLK_DISABLED_PIN); \
    NRF_GPIO->DIRCLR = (1 << DBG_HFCLK_DISABLED_PIN); \
    NRF_GPIO->OUTCLR = (1 << DBG_HFCLK_DISABLED_PIN); \
} */
/* #define DBG_PKT_SENT                               \
{                                                     \
    NRF_GPIO->OUTSET = (1 << DBG_PKT_SENT_PIN);       \
    NRF_GPIO->DIRSET = (1 << DBG_PKT_SENT_PIN);       \
    NRF_GPIO->DIRCLR = (1 << DBG_PKT_SENT_PIN);       \
    NRF_GPIO->OUTCLR = (1 << DBG_PKT_SENT_PIN);       \
} */
/* #define DBG_WFE_BEGIN                              \
{                                                     \
    NRF_GPIO->OUTCLR = (1 << DBG_WFE_BEGIN_PIN);      \
    NRF_GPIO->DIRSET = (1 << DBG_WFE_BEGIN_PIN);      \
    NRF_GPIO->OUTSET = (1 << DBG_WFE_BEGIN_PIN);      \
    for ( int i = 0; i < 0xFF; i++ ) __NOP();         \
    NRF_GPIO->OUTCLR = (1 << DBG_WFE_BEGIN_PIN);      \
} */
/* #define DBG_WFE_END                                \
{                                                     \
    for ( int i = 0; i < 0xFF; i++ ) __NOP();         \
    NRF_GPIO->OUTSET = (1 << DBG_WFE_END_PIN);        \
} */


#ifndef DBG_BEACON_START
#define DBG_BEACON_START
#endif
#ifndef DBG_PKT_SENT
#define DBG_PKT_SENT
#endif
#ifndef DBG_HFCLK_ENABLED
#define DBG_HFCLK_ENABLED
#endif
#ifndef DBG_HFCLK_DISABLED
#define DBG_HFCLK_DISABLED
#endif
#ifndef DBG_WFE_BEGIN
#define DBG_WFE_BEGIN
#endif
#ifndef DBG_WFE_END
#define DBG_WFE_END
#endif


#ifdef PCA20014
static const hal_serial_cfg_t serial_cfg =
{
    .twi0.psel.scl = 27,
    .twi0.psel.sda = 26,
};    
#else
#ifdef PCA10036
static const hal_serial_cfg_t serial_cfg =
{
    .twi0.psel.scl = 25,
    .twi0.psel.sda = 23,
};
#else
static const hal_serial_cfg_t serial_cfg =
{
    .twi0.psel.scl = 29,
    .twi0.psel.sda = 25,    
};
#endif  
#endif


#define HFCLK_STARTUP_TIME_US                       (1600)              /* The time in microseconds it takes to start up the HF clock*. */
#define INTERVAL_US                                 (8000000)           /* The time in microseconds between advertising events. */
#define INITIAL_TIMEOUT                             (INTERVAL_US)       /* The time in microseconds until adverising the first time. */
#define START_OF_INTERVAL_TO_SENSOR_READ_TIME_US    (INTERVAL_US / 2)   /* The time from the start of the latest advertising event until reading the sensor. */
#define SENSOR_SKIP_READ_COUNT                      (5)                /* The number of advertising events between reading the sensor. */

#define POWERUP_DELAY_US														(400000)							/*delay after powerup the sensor*/
#define SAADC_DELAY_US															(500000)


#if INITIAL_TIMEOUT - HFCLK_STARTUP_TIME_US < 400
#error "Initial timeout too short!"
#endif


#define BD_ADDR_OFFS                (3)     /* BLE device address offest of the beacon advertising pdu. */
#define M_BD_ADDR_SIZE              (6)     /* BLE device address size. */

/* Begin - Definitions for beacons with both temperature and pressure. */
#define SINT16_TEMPERATURE_OFFS     (20)    /* The offset of the temperature in the beacon advertising pdu */
#define UINT32_PRESSURE_OFFS        (26)    /* The offset of the pressure in the beacon advertising pdu */
#define UINT32_HUMIDITY_OFFS        (34)    /* The offset of the humidity in the beacon advertising pdu */
#define UINT8_BATT_OFFS        			(35)    /* The offset of the battery in the beacon advertising pdu */
/* End - Definitions for beacons with both temperature and pressure. */

/* Begin - Definitions for beacons with only temperature. */
#define FLOAT32_TEMPERATURE_OFFS    (36)    /* The offset of the temperature in the beacon advertising pdu */
/* End - Definitions for beacons with only temperature. */

#define SAADC_CALIBRATION_INTERVAL 5              //Determines how often the SAADC should be calibrated relative to NRF_DRV_SAADC_EVT_DONE event. E.g. value 5 will make the SAADC calibrate every fifth time the NRF_DRV_SAADC_EVT_DONE is received.
#define SAADC_SAMPLES_IN_BUFFER 1                 //Number of SAADC samples in RAM before returning a SAADC event. For low power SAADC set this constant to 1. Otherwise the EasyDMA will be enabled for an extended time which consumes high current.
#define SAADC_OVERSAMPLE NRF_SAADC_OVERSAMPLE_4X  //Oversampling setting for the SAADC. Setting oversample to 4x This will make the SAADC output a single averaged value when the SAMPLE task is triggered 4 times. Enable BURST mode to make the SAADC sample 4 times when triggering SAMPLE task once.
#define SAADC_BURST_MODE 1                        //Set to 1 to enable BURST mode, otherwise set to 0.

#define ADC_REF_VOLTAGE_IN_MILLIVOLTS     600
#define ADC_RES_12BIT                     4096   
#define ADC_PRE_SCALING_COMPENSATION      6   

