victor999/nrf52-env-beacon/env-beacon_v2/src/sensor_beacon.c
						(void)drv_mcp9808_close();
				}
				else
				{
						(void)drv_mcp9808_close();
				}
    
				m_time_us += POWERUP_DELAY_US;
			
				m_rtc_isr_called = false;
				hal_timer_timeout_set(m_time_us);
				wait_for_timer();
			
				if ( drv_bme280_open(&m_drv_bme280_cfg) == DRV_BME280_STATUS_CODE_SUCCESS )
				{
						drv_bme280_access_mode_set(DRV_BME280_ACCESS_MODE_CPU_INACTIVE);
    
						read_coefficients(); // read trimming parameters, see DS 4.2.2

						sensor_set_sampling(MODE_NORMAL,
							SAMPLING_X1,
							SAMPLING_X1,
							SAMPLING_X1,
							FILTER_OFF,
							STANDBY_MS_1000); // use defaults
					
						(void)drv_bme280_close();
				}
				else
				{
						(void)drv_bme280_close();
				}
    }
    else
    {
        (void)drv_bme280_close();
    }
}

/* Powers up the the mcp9808 device and TWI pull-up resistors.
 */
static void sensor_chip_powerup(void)
{		
		if ( drv_mcp9808_open(&m_drv_mcp9808_cfg) == DRV_MCP9808_STATUS_CODE_SUCCESS )
		{
				drv_mcp9808_access_mode_set(DRV_MCP9808_ACCESS_MODE_CPU_INACTIVE);
			
				set_normal_mode();
			
				(void)drv_mcp9808_close();
		}
		else
		{
				(void)drv_mcp9808_close();
		}
}


/* Ends after measuring temperature and pressure.
 */
static void sensor_chip_measurement_done(void)
{
		if ( drv_mcp9808_open(&m_drv_mcp9808_cfg) == DRV_MCP9808_STATUS_CODE_SUCCESS )
		{
				drv_mcp9808_access_mode_set(DRV_MCP9808_ACCESS_MODE_CPU_INACTIVE);
			
				set_shutdown_mode();
			
				(void)drv_mcp9808_close();
		}
		else
		{
				(void)drv_mcp9808_close();
		}
}


/* Sends an advertising PDU on the given channel index.
 */
static void send_one_packet(uint8_t channel_index)
{
    uint8_t i;
    
    m_radio_isr_called = false;
    hal_radio_channel_index_set(channel_index);
    hal_radio_send(m_adv_pdu);
    while ( !m_radio_isr_called )
    {
        cpu_wfe();
    }
    
    for ( i = 0; i < 9; i++ )
    {
        __NOP();
    }
}


void get_battery_level(uint8_t* bat_level)
{
		*bat_level = g_batteryVoltage_mv / 100 * 2;
}


/* Handles sensor managing.
 */
static void sensor_handler(void)
{
    int32_t temperature = 0;	
		uint32_t pressure = 1000;
		uint16_t humidity = 80;
		uint8_t battery_level = 28;

		if ( drv_mcp9808_open(&m_drv_mcp9808_cfg) == DRV_MCP9808_STATUS_CODE_SUCCESS )
		{
				drv_mcp9808_access_mode_set(DRV_MCP9808_ACCESS_MODE_CPU_INACTIVE);
				int32_t temp2 = 0;
				drv_mcp9808_temperature_get(&temp2);
			
				temperature = temp2;
			
				(void)drv_mcp9808_close();
		}
		else
		{
				(void)drv_mcp9808_close();
		}
		
		if ( drv_bme280_open(&m_drv_bme280_cfg) == DRV_BME280_STATUS_CODE_SUCCESS )
		{
				drv_bme280_access_mode_set(DRV_BME280_ACCESS_MODE_CPU_INACTIVE);
		
				float real_temp = sensor_read_temperature();
//				temperature = real_temp * 1000;
			
				float real_hum = sensor_read_humidity();
				humidity = real_hum;
			
				float real_press = sensor_read_pressure();
				pressure = real_press;
			
				(void)drv_bme280_close();
		}
		else
		{
				(void)drv_bme280_close();
		}
		

		get_battery_level(&battery_level);
				
		m_beacon_pdu_sensor_data_set(&(m_adv_pdu[0]), &temperature, &pressure, &humidity, &battery_level);   
}

void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
    ret_code_t err_code;
    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)                                                        //Capture offset calibration complete event
    {
	
        if((m_adc_evt_counter % SAADC_CALIBRATION_INTERVAL) == 0)                                  //Evaluate if offset calibration should be performed. Configure the SAADC_CALIBRATION_INTERVAL constant to change the calibration frequency
        {
            nrf_drv_saadc_abort();                                                                      // Abort all ongoing conversions. Calibration cannot be run if SAADC is busy
            m_saadc_calibrate = true;                                                                   // Set flag to trigger calibration in main context when SAADC is stopped
        }  
        
        if(m_saadc_calibrate == false)
        {
						float measured_voltage = (float)(p_event->data.done.p_buffer[0]) * 0.6 * 6.0 / 16384.0; 
				
						g_batteryVoltage_mv = measured_voltage * 1000; //ADC_RESULT_IN_MILLI_VOLTS(p_event->data.done.p_buffer[0]);
					
            err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAADC_SAMPLES_IN_BUFFER);             //Set buffer so the SAADC can write to it again. 						
        }
        
        m_adc_evt_counter++;
  
    }
    else if (p_event->type == NRF_DRV_SAADC_EVT_CALIBRATEDONE)
    {
     
        err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[0], SAADC_SAMPLES_IN_BUFFER);             //Set buffer so the SAADC can write to it again. 
 
        err_code = nrf_drv_saadc_buffer_convert(m_buffer_pool[1], SAADC_SAMPLES_IN_BUFFER);             //Need to setup both buffers, as they were both removed with the call to nrf_drv_saadc_abort before calibration.
        
    }
}

void calibration_handler(void)
{
	if(m_saadc_calibrate == true)
	{
			while(nrf_drv_saadc_calibrate_offset() != NRF_SUCCESS); //Trigger calibration task
			m_saadc_calibrate = false;
	}
}

void saadc_init(void)
{
    ret_code_t err_code;
    nrf_drv_saadc_config_t saadc_config;
    nrf_saadc_channel_config_t channel_config;


	
    //Configure SAADC
    saadc_config.low_power_mode = true;                                                   //Enable low power mode.
    saadc_config.resolution = NRF_SAADC_RESOLUTION_14BIT;                                 //Set SAADC resolution to 12-bit. This will make the SAADC output values from 0 (when input voltage is 0V) to 2^14=16384 (when input voltage is 3.6V for channel gain setting of 1/6).
    saadc_config.oversample = SAADC_OVERSAMPLE;                                           //Set oversample to 4x. This will make the SAADC output a single averaged value when the SAMPLE task is triggered 4 times.
    saadc_config.interrupt_priority = APP_IRQ_PRIORITY_LOW;                               //Set SAADC interrupt to low priority.
	
